88markus88/ESP32_Anchor_Alarm/src/ePaperAnchorAlarm.cpp
    //----- anchorBearingDeg: direction to anchor
    if(preferences.isKey("anchorBearingDeg"))   // anchorBearingDeg
      wData.anchorBearingDeg = preferences.getFloat("anchorBearingDeg", d_anchorBearingDeg);
    else {  // set default    
      wData.anchorBearingDeg = d_anchorBearingDeg;
      preferences.putFloat("anchorBearingDeg", wData.anchorBearingDeg);
    }

    //----- anchorDistanceM: distance to anchor
    if(preferences.isKey("anchorDistanceM"))   // anchorDistanceM
      wData.anchorDistanceM = preferences.getFloat("anchorDistanceM", d_anchorDistanceM);
    else {  // set default    
      wData.anchorDistanceM = d_anchorDistanceM;
      preferences.putFloat("anchorDistanceM", wData.anchorDistanceM);
    }

    //int bytes2= preferences.getBytes("teststring2", teststring2, 80); // test
    //preferences.remove("teststring1"); // remove single key
    //preferences.clear();  // clear the namespace completely
    preferences.end(); // close the namespace

    sprintf(outstring,"Read Preferences: verbosity: %ld graphWeight: %ld Meas.IntervalSec %ld alarmDistance %3.1f alarmThreshold %ld",
            wData.verbosity, wData.graphWeight, wData.targetMeasurementIntervalSec, wData.alarmDistanceM, wData.alarmThreshold);
    logOut(2,outstring); 
    sprintf(outstring,"Read Preferences: anchorBearingDeg: %3.1f anchorDistanceM: %3.1f ",
            wData.anchorBearingDeg, wData.anchorDistanceM);
    logOut(2,outstring);         
}    

/*****************************************************************************! 
  @brief  write all preference values
  @details 
  @return void
*****************************************************************************/
void writePreferences()
{
    size_t ret1, ret11, ret12, ret13, ret2, ret3, ret4, ret5, ret6, ret7;

    ret1=preferences.begin(prefIDENT, false);
    if(!ret1){
      sprintf(outstring,"could open preferences for writing, ret: %d", ret1);
      logOut(2,outstring);
    }  
    
    // verbosity and graph weight
    ret11 =   preferences.putULong("verbosity", wData.verbosity);
    ret12 =   preferences.putULong("graphWeight", wData.graphWeight);

    // measurement interval in seconds
    ret13 =   preferences.putLong("mIntervSec", wData.targetMeasurementIntervalSec);

    //----- alarm distance and alarm threshold
    ret2 = preferences.putFloat("alarmDistanceM", wData.alarmDistanceM);
    ret3 = preferences.putLong("alarmThreshold", wData.alarmThreshold);

    //----- distance and bearing to anchor which are set initially
    ret4 = preferences.putFloat("anchorBearingDeg", wData.anchorBearingDeg);
    ret5 = preferences.putFloat("anchorDistanceM", wData.anchorDistanceM);

    //int bytes2= preferences.getBytes("teststring2", teststring2, 80); // test
    //preferences.remove("teststring1"); // remove single key
    //preferences.clear();  // clear the namespace completely
    preferences.end(); // close the namespace

    sprintf(outstring,"Wrote Preferences: verbosity: %ld graphWeight: %ld Meas.IntervalSec %ld alarmDistance %3.1f alarmThreshold %ld",
            wData.verbosity, wData.graphWeight, wData.targetMeasurementIntervalSec, wData.alarmDistanceM, wData.alarmThreshold);
    logOut(2,outstring); 
    sprintf(outstring,"Read Preferences: anchorBearingDeg: %3.1f anchorDistanceM: %3.1f ",
            wData.anchorBearingDeg, wData.anchorDistanceM);
    logOut(2,outstring);       
    sprintf(outstring,"Wrote Preferences: ret values: %d %d %d %d %d %d %d %d \n", 
                ret1, ret11, ret12, ret13, ret2, ret3, ret4, ret5);
    logOut(2,outstring); 
}


/*****************************************************************************! 
  @brief  writeCounterPreferences()
  @details writes the counter related preference data
  @return void
*****************************************************************************/
/*
void writeCounterPreferences()
{
  int ret11, ret12, ret13;
  bool writing_counter_prefs = false;
  writing_counter_prefs = true;
  sprintf(outstring,"writeCounterPreferences: startCounter %ld dischgCnt %ld prevVoltage %f prevMicrovolt %ld\n", 
     startCounter, dischgCnt, prevVoltage, prevMicrovolt),
  logOut(2,outstring);
  // open preferences namespace in rw mode mode and write preferences infos.
  preferences.begin(prefIDENT, false);

  // counters and previous microvolts
  ret11 =   preferences.putULong("startCounter", startCounter);  
  ret12 =   preferences.putULong("dischargeCnt", dischgCnt);
  ret13 =   preferences.putULong("prevMicrovolt", prevMicrovolt);
  preferences.end(); // close the namespace
  sprintf(outstring,"Write Counter preferences startCounter: %ld %d dischgCnt: %ld %d prevMicrovolt: %ld %d\n", 
    startCounter, ret11, dischgCnt, ret12, prevMicrovolt, ret13);
  logOut(2,outstring);        
}
*/

/*****************************************************************************! 
  @brief  setup routine
  @details 
  @return void
*****************************************************************************/
void setup()
{
  startTimeMillis = millis(); // remember time when woken up
  Serial.begin(115200);   // set speed for serial monitor

  logOut(2,(char*)"**********************************************************");
  sprintf(outstring,"* %s %s - %s ",PROGNAME, VERSION, BUILD_DATE);
  logOut(2,outstring);
  logOut(2,(char*)"**********************************************************");

  #ifdef READ_PREFERENCES
    // get data from EEPROM using preferences library in readonly mode
    sprintf(outstring," before readPreferences()");
    logOut(2,outstring);
    readPreferences();
  #endif

  // increment start counter
  wData.startCounter++;

   // initialize rotary encoder
   ESP32Encoder::useInternalWeakPullResistors = puType::up;
   encoder.attachHalfQuad(ENCODER_CLK_PIN, ENCODER_DT_PIN);
   encoder.setCount(0);

   /*
   // initialize encoder switch at pin ENCODER_SW_PIN
   pinMode(ENCODER_SW_PIN, INPUT_PULLUP);
   // prepare de-bounced button
   button.attach(ENCODER_SW_PIN);
   button.interval(5);
  */
  // button via interrupt
  pinMode(ENCODER_SW_PIN, INPUT_PULLUP);
  attachInterrupt(
    digitalPinToInterrupt(ENCODER_SW_PIN),
    handleButtonInterrupt,
    FALLING
  );

  // initialize the display
  logOut(2,(char*)"before initDisplay()");
  initDisplay(wData.startCounter, FULL_UPDATE_INTERVAL); 

  // Serial port for GPS module
  ss.begin(9600, SERIAL_8N1, RXPin, TXPin); // RX, TX
  gpsTimerHandle = gpsTimer.setInterval(200L, gpsHandler); // set gps test timer to 100 milliseconds

