88markus88/ESP32_Anchor_Alarm/src/ePaperAnchorAlarm.cpp
        }  
      }
      break;
    case MODE_CHANGEPARAM:    // 2 input mode to set a specific parameter, defined by last triangePos
      {
        if(!handleParamchanges) // do not draw triangle if already in param change mode, takes too long
        {
          sprintf(outstring,"doRoutineWork: MODE_CHANGEPARAM. wData.Button: %d handleParamchanges: %d", 
              wData.buttonPressed, handleParamchanges);
          logOut(2, outstring);
          drawTriangle(true,INPUTDATA_X_POS, trianglePos * INPUTDATA_FONT_SIZE + INPUTDATA_Y_POS); // draw triangle
        }
        // if button pressed again, and not yet in param change mode, go to param change mode
        if(wData.buttonPressed && !handleParamchanges){
          handleParamchanges = true;
          wData.buttonPressed = false; // reset button pressed state  
          drawTriangle(true,INPUTDATA_X_POS, trianglePos * INPUTDATA_FONT_SIZE + INPUTDATA_Y_POS); // draw triangle once
        }  
        // if button pressed again, and already in param change mode, go back to select line mode
        if(wData.buttonPressed && handleParamchanges){
          handleParamchanges = false;
          wData.buttonPressed = false; // reset button pressed state  
          wData.currentMode = MODE_SELECTLINE; // go to change param mode
          menuStartTimer = millis();            // remember timer when gone to change parameter mode
        } 

        if(handleParamchanges){
          boolean ret = handleParamChange(trianglePos); // handle parameter change within a line
          if(!ret){ // exit parameter change mode, go to running mode - anchor alarm active
            handleParamchanges = false;
            // get anchor position from current GPS position
            getGPSStartPosition(&wData.actLat, &wData.actLon); // get averaged boat start position from GPS
            sprintf(outstring,"doRoutineWork: MODE_CHANGEPARAM: Exiting. Current GPS position Lat: %6.4f Lon: %6.4f", 
                wData.actLat, wData.actLon);  
            logOut(2, outstring);
            // project anchor distance and bearing from start position to get anchor position
            gps_offset(wData.actLat, wData.actLon, wData.anchorDistanceM, wData.anchorBearingDeg, &wData.anchorLat, &wData.anchorLon);
            sprintf(outstring,"doRoutineWork: MODE_CHANGEPARAM: Exiting. Anchor position set to Lat: %6.4f Lon: %6.4f", 
                wData.anchorLat, wData.anchorLon);
            logOut(2, outstring);
            //initialize draw buffer
            wData.drawCount = 0;
            for (int i=0; i<maxDrawBufferLen; i++){
              wData.drawBuffer[i][0] = 0;
              wData.drawBuffer[i][1] = 0;
            }
            updatewData(); // populate wData structure for first run, then no update of gps data expected
            wData.currentMode = MODE_RUNNING; // go to change param mode
          }
        }  
        // safeguared against accicental keypress: if too long in menu, go to routine mode and do measurements
        if(millis() - menuStartTimer > MAX_MILLIS_IN_MENU)
          wData.currentMode = MODE_RUNNING; // go to measurement mode
      }
      break;  
    case MODE_RUNNING:    // anchor alarm active
      {
        if(!wData.buttonPressed){ // button pressed means: quiet alarm, back to menu
          double startLat = 0.0; double startLon = 0.0;
          sprintf(outstring,"doRoutineWork: MODE_RUNNING ... %d", cnt++);
          logOut(2, outstring);
          
          // we need a bit of time to get the GPS data
          for(int i=0; i<3; i++)
          {  
            if((gps.location.isUpdated() && gps.location.isValid())) 
              break;
            smartDelay(1000);  
          }    
          
          updatewData();
          sprintf(outstring,"doRoutineWork: MODE_RUNNING: Current GPS position Lat: %6.6f Lon: %6.6f", 
              wData.actLat, wData.actLon);                
          logOut(2, outstring);
          
          sprintf(outstring,"doRoutineWork: MODE_RUNNING: Current distance anchor-boat: %4.2f m Bearing anchor-boat: %4.2f°", 
              wData.actAnchorDistanceM, wData.actAnchorBearingDeg); 
          logOut(2, outstring);
          //} if 
          drawWatchScreen();
          
          if(wData.alertON){    
            buzzer(3, 100,50);
            //doParallelBuzzer(3, 100,50);
            sprintf(outstring,"!!!!!!!!!!!! ALERT Reason %d %s !!!!!!!!!!!!",wData.alertReason, wData.alertReasonString);
            logOut(2,outstring);
            smartDelay(1000);
          }  
          else{
            // sleep for a time: switch off display, deep sleep for ESP32, leave gps receiving
            targetSleepUSec= wData.targetMeasurementIntervalSec * SECONDS;
            gotoDeepSleep(BUTTON1, targetSleepUSec); // go to deep sleep. parameters: sleeptime in us, button to wakeup from  
            //smartDelay(5000);
          } // else alert on


        }
        else{ // button pressed
          wData.buttonPressed = false; // reset button pressed state  
          wData.alertON = false;       // reset alarm
          wData.currentMode = MODE_STARTED; // go to start mode
        }    
      }
      break;
    default:  
    {
      sprintf(outstring,"doRoutineWork: default %d in case statement", trianglePos);
      logOut(2, outstring);
    }
  }  

  #ifdef WRITE_PREFERENCES
  // write counter preferences
  // if(startCounter % d_counterWriteInterval == 0){
  //   writeCounterPreferences();
  // }
  // write all preferences, incl. counter
    if(wData.preferencesChanged){
      writePreferences();
      wData.preferencesChanged = false;
    }
  #endif
} // doRoutineWork


/*****************************************************************************! 
  @brief  checkButton()    
  @details 
  @return void
*****************************************************************************/
void checkButton()
{
  if (buttonEvent) {
    buttonEvent = false;
    if(!wData.buttonPressed){
      logOut(2, (char*)"Interrupt: Rotary encoder button released.");
      wData.buttonPressed = true;
      //buzzer(1,50,0); // buzzer feedback
      doParallelBuzzer(1,50,0);
    } 
    sprintf(outstring,"Interrupt: Button wurde gedrückt");
    logOut(2, outstring);
  }
} 

/*****************************************************************************! 
  @brief  main loop
  @details 
  @return void
*****************************************************************************/
void loop() 
{
  // Update the Bounce instance (YOU MUST DO THIS EVERY LOOP)
  /*
  button.update(); // for button debouncing
  int buttonState = button.read();
  if(buttonState == LOW ){
    logOut(2, (char*)"Rotary encoder button pressed.");
    //buzzer(1,50,0); // buzzer feedback
    wData.buttonPressed = true;
  }
  */
  checkButton();

  doRoutineWork();
  gpsTimer.run(); // run gps timer to get data from gps module
};